{"id":48,"date":"2017-09-24T19:47:13","date_gmt":"2017-09-25T01:47:13","guid":{"rendered":"https:\/\/www.coldlakesar.ca\/?page_id=48"},"modified":"2017-09-24T19:47:13","modified_gmt":"2017-09-25T01:47:13","slug":"how-to-join","status":"publish","type":"page","link":"https:\/\/www.coldlakesar.ca\/how-to-join\/","title":{"rendered":"How to Join"},"content":{"rendered":"<p>Cold Lake Search and Rescue(Est.2010) team members are highly trained volunteers come from all walks of life. We are always accepting new members.<\/p>\n<p>We are a professional volunteer organization. CLSARS is a not for profit society registered with the Province of Alberta.We do not get paid for our work. Each member is responsible for providing his or her own personal gear (24 hour pack, clothing, etc ) we can help with this as a team. We train and search in all types of weather, temperatures, and terrain (not everyone goes missing on hot days) We search for all kinds of people in all kinds of situations: missing hikers, hunters, children, Alzheimer&#8217;s patients, suicide victims and more. We also do evidence searches including those for human remains. You always have the option of not going on a callout, but we want you to know upfront that we do a lot more than just finding missing hikers.<\/p>\n<p>Cold Lake Search and Rescue Society is looking for people who are interested in helping in the Lakeland area and surrounding areas when persons are injured, lost or missing.<\/p>\n<p><u>Executive Positions<\/u> &#8211;<\/p>\n<p>President<\/p>\n<p>Vice President<\/p>\n<p>Treasurer<\/p>\n<p>Secretary<\/p>\n<p>Equipment Manager<\/p>\n<p>Training Officer<\/p>\n<p>Public Relations.<\/p>\n<p>The Executive is elected by Regular Members in accordance with our By-Law and Constitution.<\/p>\n<p><u>Search Team Members<\/u> &#8211; shall have a current Standard First Aid with CPR and must have completed a Search and Rescue Basic Course. The SAR Basic will be provided to at no charge as we conduct our own. Cold Lake prides itself in having 6 certified SAR Basic Instructors in house.<\/p>\n<p><u>Logistical Support Team <\/u> &#8211; help with setting up and maintaining command post and facilities at searches and during search exercises.<\/p>\n<p><u>Administration<\/u> &#8211; every club needs people who can keep things running smoothly.<\/p>\n<p><u>Fund Raising and Public Relations<\/u> &#8211; do you like getting out and meeting people? Help Cold Lake SAR fund needed equipment and training.<\/p>\n<p>Keep in mind the terrain and environments we actively work in. Being physically fit is key when you aid in an active search.<\/p>\n<p>To join the group you must be:<\/p>\n<ul>\n<li>Minimum of 18 years old<\/li>\n<li>Have transportation or access to 24\/7<\/li>\n<li>At the local RCMP station ask for an application to join the Cold Lake Search and Rescue Society. They will give you the application and a criminal record check form. Once both are filled out ( the vulnerable sector of the Criminal Record check is checked off), return them to the RCMP who will process them and let us know of your intentions. We will contact you from there. If you have any question feel free to e-mail us from the &#8220;Contact Us&#8221; tab.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Cold Lake Search and Rescue(Est.2010) team members are highly trained volunteers come from all walks of life. We are always accepting new members. We are a professional volunteer organization. CLSARS is a not for profit society registered with the Province of Alberta.We&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"inline_featured_image":false,"footnotes":""},"class_list":["post-48","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/pages\/48","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/comments?post=48"}],"version-history":[{"count":0,"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/pages\/48\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.coldlakesar.ca\/wp-json\/wp\/v2\/media?parent=48"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}